code/Transbank/Webpay/logs/webpay-2017-08-26.txt

00:17:48 - datos request initTransaction 
Array
(
    [wSTransactionType] => TR_MALL_WS
    [commerceId] => 597020000542
    [buyOrder] => 000000251
    [sessionId] => 
    [returnURL] => http://sm-dev.xpectrumtech.com/webpay/payment/response
    [finalURL] => http://sm-dev.xpectrumtech.com/webpay/payment/success
    [transactionDetails] => Array
        (
            [commerceCode] => 597020000543
            [buyOrder] => 000000251
            [amount] => 4714.76
        )

)

00:17:49 - initTransaction request  - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-19612"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-19611"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>Dt9qlifKCwARCx+mKu0MGHKRV0k=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>ZSO5dnSt3hW/ItEV8laxFuGZ8p9zO7C2QOn6PVODr0otNDKxa7XsWsYWzFN3146JPrVRisL2/XY2
w3ty390bv+nqYdVnlUZECNAevkCdCY7LLpaLTSs8J3rk91BRxEmutp0sQfJVzIcOK2zE+hHCgy6y
jTMUZo0MEpxks5jltVMoMJUyuuOKF3U6JjWJouPEFR/doAUPoethpyF6vX9qfZwqt25YaR3nLLDu
oV9MHChZoDoIUJPOelGHNeIK1QX27fhC+bFn4j8SY3m2UowxGbcBzRvjHNXmlFd1pRzd/5fxQiFh
12zv5hNoKlp82UwA2Kb1G3sFHVg9az/Qsx8YZw==</ds:SignatureValue><ds:KeyInfo Id="KI-7789806F6FCE762484150370666568229417"><wsse:SecurityTokenReference wsu:Id="STR-7789806F6FCE762484150370666568229418"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-19611"><ns2:initTransactionResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><token>ef9ff372431d7d192c7f01b82f60858993c96d417a15404bcbc362110d4d614c</token><url>https://webpay3gint.transbank.cl/filtroUnificado/initTransaction</url></return></ns2:initTransactionResponse></soap:Body></soap:Envelope>

00:17:49 - initTransaction response - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-19612"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-19611"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>Dt9qlifKCwARCx+mKu0MGHKRV0k=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>ZSO5dnSt3hW/ItEV8laxFuGZ8p9zO7C2QOn6PVODr0otNDKxa7XsWsYWzFN3146JPrVRisL2/XY2
w3ty390bv+nqYdVnlUZECNAevkCdCY7LLpaLTSs8J3rk91BRxEmutp0sQfJVzIcOK2zE+hHCgy6y
jTMUZo0MEpxks5jltVMoMJUyuuOKF3U6JjWJouPEFR/doAUPoethpyF6vX9qfZwqt25YaR3nLLDu
oV9MHChZoDoIUJPOelGHNeIK1QX27fhC+bFn4j8SY3m2UowxGbcBzRvjHNXmlFd1pRzd/5fxQiFh
12zv5hNoKlp82UwA2Kb1G3sFHVg9az/Qsx8YZw==</ds:SignatureValue><ds:KeyInfo Id="KI-7789806F6FCE762484150370666568229417"><wsse:SecurityTokenReference wsu:Id="STR-7789806F6FCE762484150370666568229418"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-19611"><ns2:initTransactionResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><token>ef9ff372431d7d192c7f01b82f60858993c96d417a15404bcbc362110d4d614c</token><url>https://webpay3gint.transbank.cl/filtroUnificado/initTransaction</url></return></ns2:initTransactionResponse></soap:Body></soap:Envelope>

00:18:43 - transactionResult request  - <?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://service.wswebpay.webpay.transbank.com/"><SOAP-ENV:Body><ns1:getTransactionResult><tokenInput>ef9ff372431d7d192c7f01b82f60858993c96d417a15404bcbc362110d4d614c</tokenInput></ns1:getTransactionResult></SOAP-ENV:Body></SOAP-ENV:Envelope>

00:18:43 - transactionResult response - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-19614"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-19613"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>B2T4Pnbwk4HwvqVsvTR24D3fW2A=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>Vr7gtTQmYroKo0iAxEZHqXtu7vjPWb6dHdVmbRyLDq8DHtVgzzE8t+r+k0roxDiDabyW4utl8h+z
vWpdCf0divcyV5/3wTQnHfz8m/BAJ2IS0qOh22EmOLob0U8o6S2m8ZTs2PVIFgPwOv5USmqqFTAN
kR4Yn0yXCCMsXZheYcMQ78S350KTfR14HF6m0Ba1kXVTYJRspAcJvaVI6oHHorMjBiZvB8aUqjBZ
KuRwbl8bm73KnMWVyvOVI1VaeiQiKjnny/leeLvEkvoAyAkmM8V5zwwSUw/ATh5QKErF5id2fkdL
8HOJhsRTDONP+JIWltsKiPnjCSrwgG2+haS82g==</ds:SignatureValue><ds:KeyInfo Id="KI-7789806F6FCE762484150370671931629420"><wsse:SecurityTokenReference wsu:Id="STR-7789806F6FCE762484150370671931629421"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-19613"><ns2:getTransactionResultResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><accountingDate>0825</accountingDate><buyOrder>000000251</buyOrder><cardDetail><cardNumber>6623</cardNumber></cardDetail><detailOutput><sharesNumber>0</sharesNumber><amount>4714.76</amount><commerceCode>597020000543</commerceCode><buyOrder>000000251</buyOrder><authorizationCode>1213</authorizationCode><paymentTypeCode>VD</paymentTypeCode><responseCode>0</responseCode></detailOutput><transactionDate>2017-08-25T20:17:45.557-04:00</transactionDate><urlRedirection>https://webpay3gint.transbank.cl/filtroUnificado/voucher.cgi</urlRedirection><VCI>TSY</VCI></return></ns2:getTransactionResultResponse></soap:Body></soap:Envelope>

00:18:44 - acknowledgeTransaction request  - <?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://service.wswebpay.webpay.transbank.com/"><SOAP-ENV:Body><ns1:acknowledgeTransaction><tokenInput>ef9ff372431d7d192c7f01b82f60858993c96d417a15404bcbc362110d4d614c</tokenInput></ns1:acknowledgeTransaction></SOAP-ENV:Body></SOAP-ENV:Envelope>

00:18:44 - acknowledgeTransaction response - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-19616"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-19615"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>HRS3kc/yN3cE7EuRCqn9wgUlmJU=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>FiEJgtyXJfwmQ1yyKzVp1+MbluXzsLaoi8m5BGq2V0ZTeEaGbzuv19C9yP2ec6xr9ingap9QooZz
fvJrQa+gGG4TQ7ThfXoJz7S1F5ut27Fu2UT/DxcY50TISi5ErFtBeCBivazsqe1M2ELLc7ojN6c7
5iwhAtTepChQz4ATC6eAGDe3UJkfQTPBqLawUaVwKzogrt1y3S+btv5e9Kldme0KDepSKJOHzzda
dne87ixxyIVit/LZWJwiGf1jgKDNpqEEOVIn+Rh/951812el5wRt0SsfKE7gfLWbJ/xQ/UMfUKjs
2FMSklNXFzF7eTumgEGL0InbtEDq+GMQDVGPIw==</ds:SignatureValue><ds:KeyInfo Id="KI-7789806F6FCE762484150370672047729423"><wsse:SecurityTokenReference wsu:Id="STR-7789806F6FCE762484150370672047729424"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-19615"><ns2:acknowledgeTransactionResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"/></soap:Body></soap:Envelope>

20:51:03 - datos request initTransaction 
Array
(
    [wSTransactionType] => TR_MALL_WS
    [commerceId] => 597020000542
    [buyOrder] => 000000252
    [sessionId] => 
    [returnURL] => http://sm-dev.xpectrumtech.com/webpay/payment/response
    [finalURL] => http://sm-dev.xpectrumtech.com/webpay/payment/success
    [transactionDetails] => Array
        (
            [commerceCode] => 597020000543
            [buyOrder] => 000000252
            [amount] => 4714.76
        )

)

20:51:05 - initTransaction request  - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-426907"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-426906"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>yfr7Gdy5dLhZRrDKm+NZqojgCEk=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>VunScHMsKSQKfsv/6T8CRKWSQi45zEq9D1+pUd5G8BpcQOOxU63tNGdXyvRryQC/H/D6iZSbZo0x
YWts/QnVZtr5I6gUu7r8YX2SzH3bEzsZxyDrXc9a/9p0DdtpTENpEyme7be+QcNOFnET1NxwSrWj
uMuMjrc7+lyAVHjLRQV4QkHpmcQwirRDC00vpuMkq8bbA+GZmeK5oEFmMAddyV+M5N5TDPreEKlz
UHnixiw0uz9dcmixmaGwbm9Uf+WDdORBnNiwdAhjcYtJd4EQkyp8NGcOepGueQ0KyazWoRXwZ83S
MSJqK807tD6751JVFBZVmy6dfXcRsOfJb1q9zg==</ds:SignatureValue><ds:KeyInfo Id="KI-7DF136BBB9F24278A11503780660336640409"><wsse:SecurityTokenReference wsu:Id="STR-7DF136BBB9F24278A11503780660336640410"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-426906"><ns2:initTransactionResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><token>e187782c8826470f8b99ec7fee94236be68195fc642195e16765219b35bf3fc0</token><url>https://webpay3gint.transbank.cl/filtroUnificado/initTransaction</url></return></ns2:initTransactionResponse></soap:Body></soap:Envelope>

20:51:05 - initTransaction response - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-426907"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-426906"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>yfr7Gdy5dLhZRrDKm+NZqojgCEk=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>VunScHMsKSQKfsv/6T8CRKWSQi45zEq9D1+pUd5G8BpcQOOxU63tNGdXyvRryQC/H/D6iZSbZo0x
YWts/QnVZtr5I6gUu7r8YX2SzH3bEzsZxyDrXc9a/9p0DdtpTENpEyme7be+QcNOFnET1NxwSrWj
uMuMjrc7+lyAVHjLRQV4QkHpmcQwirRDC00vpuMkq8bbA+GZmeK5oEFmMAddyV+M5N5TDPreEKlz
UHnixiw0uz9dcmixmaGwbm9Uf+WDdORBnNiwdAhjcYtJd4EQkyp8NGcOepGueQ0KyazWoRXwZ83S
MSJqK807tD6751JVFBZVmy6dfXcRsOfJb1q9zg==</ds:SignatureValue><ds:KeyInfo Id="KI-7DF136BBB9F24278A11503780660336640409"><wsse:SecurityTokenReference wsu:Id="STR-7DF136BBB9F24278A11503780660336640410"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-426906"><ns2:initTransactionResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><token>e187782c8826470f8b99ec7fee94236be68195fc642195e16765219b35bf3fc0</token><url>https://webpay3gint.transbank.cl/filtroUnificado/initTransaction</url></return></ns2:initTransactionResponse></soap:Body></soap:Envelope>

